{
    "reviews": [
        {
            "review_id": "82BCmTjCEVbvB0-pczvl-A",
            "user_id": "oq2aO7K-Y4CRKgpNgmA8tw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "I was at Williamsburg smile design for over 5 years. \nDr, Maples  and his assistant deserve 5 stars from me. The from desk is a disaster. They scare many clients away, absolutely not professional. After 5 years being their client, I missed one appointment and needed to pay $100 dismissals fees, which is absolutely fine, just the timing I got asked for a credit card was absolutely not appropriate. I was sitting at the busy office with people around me. Maybe after 5 years you should have just asked for this $100 at my next appointment. They wanted to know when I would love to have my next appointment, I just couldn't wrap my head around at this moment. The front desk is lacking on knowledge how to treat people and sympathy. I do not think they like clients. Just bc I was not able in that particular moment to give a new date, they told me, I should never come to their office again. Dear DR MAPES I seriously hope, you read this review! You are loosing clients, in cause of unprofessional acting of your front desk! After 5 years you should know better how to treat your clients.",
            "date": "2019-12-13 00:51:46"
        },
        {
            "review_id": "ZU9iWGvy2CND92x08V7q8A",
            "user_id": "L1fcLJGRE1QyG2XmmA0VFg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "The front desk girls are pleasant.. Rosie takes her job seriously and is seemingly caring... what's not pleasant is getting surprise bills when you were told multiple times they \"are in network\". After paying in full and upfront twice for said dental work . I get two surprise bills. They only told me after the bills came in that they are that they are NOT in network with anyone. They charge the max amount to insurance then bill you some more . Total 900$ four small fillings ... two of which were \"buffed\" out . Should have read reviews before going",
            "date": "2019-06-10 22:15:59"
        },
        {
            "review_id": "J5EJQxpJY0GzwN2BUz1fWg",
            "user_id": "vO66ZO-QERnIi0_HrPhxHg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 3,
            "funny": 0,
            "cool": 0,
            "text": "Fraudulent insurance practices and I will be escalating this one. Williamsburg Smiles Design/Ian Mapes -  just stay away!!! It really is a shame for a small business to use such deceptive practices. Long story short. THEY ARE NOT IN NETWORK AT ANY INSURANCE COMPANY AND WILL USE CLAIM CODES TO BILL YOU THE HIGHEST OUT OF NETWORK RATE THEY CAN GET - OFTEN THE CODES ARE DUPLICATIVE - SAME PROCEDURE. I did a root canal/crown there, a couple of years ago and at the onset of the procedures I explicitly asked for \"costs and predetermination\", the billing manager assures me of costs, tells me that i will be charged in-network rates. Particularly noteworthy because if she hadn't i would have walked away. She even spelled out the costs - by email, then proceeded to collect my portion of the payment on the day of procedure and settle at that point. After they had collected thousands of dollars from my insurance company for root canal/post/crown using duplicated procedure codes for the exact same treatment they then sent me a bill - 1.5 years later with erroneous payment info that doesn't match the Claim Receipt Payment from the insurance company. By that time, the original manager who dealt with insurance/received payment and got the business -  had left the company. Their predetermination vs what they actually bill vs insurance claim receipts don't match. This is fraud.",
            "date": "2018-07-09 03:36:02"
        },
        {
            "review_id": "a3L3oFfPiOTydj6fzu57iQ",
            "user_id": "LtpNMSNrjqz9ey1RzXMPyg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 5,
            "funny": 0,
            "cool": 0,
            "text": "NEVER GO HERE UNLESS YOU WANT TO BE BLINDLY CHARGED!\n\nThis is crazy as I had the worst experience here just like so many of the other reviews. I was told that my insurance would cover the appt and that they would just hold a credit card on file for basic procedure but would not be charged. The appt itself was awful, basically a 15 min cleaning and some x-rays. The receptionist was quite misleading as he wouldn't give me any solid price or bill in the end. They called and emailed relentlessly to rescedule a 2nd appt but I asked them to stop as I had no intention of getting another bad cleaning.\n\nI since notice a charge for $308 on my card. They never sent a bill or notified me of any charges and just billed without my knowledge. They obviously had my contact info as they were contacting me for repeat business. The manager was quite infuriating to deal with, her name was Natalie. I had called and emailed multiple times and she chose to ignore most of them. \n\nAt first I was told that the price was for x-rays when at the appt it was supposed to be comp'd. Now shes saying the typical cleaning price is $308. They keep changing their story on what the pricing is and if a bill was ever sent. They said they sent a bill, but that's anew development. \n\nIt must be so tiring stealing money from customers, they're crooks. I advise to never go here or get a sold list of prices on a bill before walking into an exam room. I wish there was a organization that regulated on their business so it would be shut down.",
            "date": "2018-05-29 20:33:59"
        },
        {
            "review_id": "JCAyOZw5GUu6tMG4XZ9dbg",
            "user_id": "NTaiRDS_83Vxrrcn1l46OA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 4,
            "funny": 0,
            "cool": 0,
            "text": "BEWARE!!!! I got charged twice 500 for cleaning when I only went once!!!!",
            "date": "2018-05-22 23:23:05"
        },
        {
            "review_id": "hC8M9FfWCpzKuuhK1lSJKQ",
            "user_id": "aKmT9P5WSnt1bk0T_C_6lA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 6,
            "funny": 0,
            "cool": 0,
            "text": "PATIENT BEWARE! \n\nI had some work done here. They gave no indication that part of it would not be covered by my insurance. I don't get anything in the mail. Months later I start getting calls from a collection agency telling them I owe Williamsburg Smile multiple hundred dollars. \n\nI call Williamsburg Smile to get the overview. Indeed they're charging me an exorbitant amount that was never run by me or communicated to them. 'Fine, take your money, but I'm not going to pay the collections fee as I never received a bill from you. Please communicate this to the collections agency.' More than a year later, I am still getting harassing calls from a collections agency because these guys don't have their act together. \n\nTruly awful business and dental practice here. Seems other reviews underscore this truth. \n\nMore bad news, I told a coworker about this place before I had my billing issue with them. They charged him multiple hundred dollars for routine work and never told him what the bill would be. The guy was skipping meals for weeks just to pay these extortionists. \n\nIf you're looking for a decent dentist go to iSmile on North 8th. They have treated me with respect and let me know what charges might be.",
            "date": "2018-05-08 15:01:43"
        },
        {
            "review_id": "PWZm6K-ycCmVth726qZzWg",
            "user_id": "NbUMPLHGOAkTBd-vn8wCiw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 3,
            "funny": 0,
            "cool": 0,
            "text": "Read all the reviews prior to coming to an appt at this place . Everybody appears to be out of their coverage plan and needs to pay out pocket and then wait for a reimbursement first all . Has the doc there considered enrolling in more coverage plans so as to not to be so inconvenient to his patients . \n\nI had initially delayed an appt waiting for initial reimbursement on a cleaning - when the reimbursement was delayed because of an error on the side of management , the manager at the front desk had the nerve to give me lip.\n\nOnce i received my first reimbursement I decided to give them a second try - this time with flexible spending account cash . The dentist that saw me could not confirm or negate the presence of cavities based on my X-rays .  I still gave them the benefit of the doubt and scheduled cavity fill and bonding that would cost over a grand . I was supposedly suppose to have gotten a reminder for my appt which I did not . So on the day of my appt I received a call asking if I would be present . I informed them that I forgot and could be on my way now. It was clear to them I would be late but they allowed for me to come in . So I rushed over , paid over 35 bucks to uber it over to find out they canceled my appt .  Why ask me to come in ??? Only to tell me that you are charging me 100 dollar missed appt fee .  Wtf . I am physician myself and the fee is astronomical !!! The manager with the huge teeth upfront needs an attitude adjustment.",
            "date": "2018-05-01 22:31:17"
        },
        {
            "review_id": "XZMSOywvkZuC1cy3fQRJkA",
            "user_id": "PQbGAX1J2YoAddYlewMoFw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 6,
            "funny": 0,
            "cool": 0,
            "text": "The list of reasons to not go here: \nThe up-sell is insane, they wanted to replace all my existing fillings, tried to sell me invisilign, and said they don't accept my insurance so I paid for my exam and cleaning out of pocket, something like $800 but it was for 2 visit cleanings. What they don't tell you is it's a \"gentle cleaning\" and they then up-sell on a deep cleaning. I've never heard that one before. They also have a $100 cancellation fee. \nThere was no one in the place when I went, what dentist have you gone to and the entire lobby is empty? I wish I read the reviews on this place first, i see so many people had the same bad experience and now i have to find a new dentist. Don't go here.",
            "date": "2018-04-03 15:32:12"
        },
        {
            "review_id": "p4ILqB253txNWqYD2sqcUQ",
            "user_id": "SJgUpnULxpxwmwgOc6AboA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 4,
            "funny": 1,
            "cool": 0,
            "text": "I was skeptical going here because it seemed all reviews were either 1 star or 5 stars-- no in-between? I scheduled a regular cleaning that the office reassured me would be covered 100% by my insurance company. Like a lot of the 1 star reviews on here I was told I had multiple cavities (I've never even had 1 before) and was charged $800 for 30 minutes of service and my insurance covered $754. I stilled owed $46, which is only a small portion, but how is a standard cleaning ever $800? Complete and total scam. DO NOT go here under any circumstances. Like many other reviewers, I feel the need to report this practice as what they are doing is beyond wrong.",
            "date": "2018-03-01 02:08:51"
        },
        {
            "review_id": "iR-kRV_Xmp-40rUHFSaQ0A",
            "user_id": "ClTs8NI1TCcTTXivOXppyg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 3,
            "funny": 0,
            "cool": 0,
            "text": "I had an almost identical experience to Denise S. below. It was incredibly sad considering that I was almost in tears regarding the cost of the implant I need. They did not even do anything except a delightfully brief cleaning and several nonconsentual x rays which they insisted was covered by my insurance.\n\nNow I am being asked for $700 and  I still haven't had any real work done. I've been saving up $4k for an implant.\n\nThis is a slap in the face and I would recommend this company trade in their glossy presentation and superfluous Netflix offerings for ethical business practice.",
            "date": "2018-02-13 05:03:01"
        },
        {
            "review_id": "oDCbabjrCEQ7QsePoEiayA",
            "user_id": "on5NPf-_C0o03pYLSLaalw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 3,
            "funny": 1,
            "cool": 6,
            "text": "These guys are great dentists. Their office is actually outside of my insurance's network, but I've been getting my dental care there anyway because Williamsburg Smile Design's dentists are so good, and the medical technology they use is state-of-the-art.  \n\nAnd I figure, it's my teeth -- and I only get one pair.  So I'm going to the best dental office, instead of the one that my insurance company wants me want to visit.\n\nI've been to several dental offices in recent years.  Williamsburg Smile Design is the best of the lot, no doubt about it.",
            "date": "2017-11-17 01:53:48"
        },
        {
            "review_id": "HhZETxA3y5PEB__yJXeUjQ",
            "user_id": "JyZ08fuz78w3Yez2OPRO5Q",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 4,
            "funny": 0,
            "cool": 0,
            "text": "Total hack of a dentist- got a bunch of fillings done, recently switched dentists and was told the fillings (note multiple) were done poorly. Most fillings should last 7 years and mine lasted less than 2. I was told the composite was all exposed and that edges were done roughly. Now I'm back to paying to get them all done.",
            "date": "2017-11-06 23:33:09"
        },
        {
            "review_id": "t3ega5P1seEZdQuCr6WTxQ",
            "user_id": "qv7u3Mxvmh386HW1DLcrRA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 6,
            "funny": 0,
            "cool": 0,
            "text": "I am really not happy with them. I phoned them up to ask if they would take my dental plan because I wanted my teeth cleaned. They did and said if I would come in just for cleaning my plan would cover it. \n\nSo I went in for 10 min they cleaned it and for 40 minutes they kept on taking pictures and pictures of my mouth. Last week I received an unexpected letter: the bill was $670.... and my health insurance only covers a part so I need to pay them around $300. So what they were saying was absolutely a scam. The cleaning wasn't that good, 10 minutes??? So you come in for a few minutes of cleaning and end up with a bill of $600. Whats wrong with this world? \n\nDon't let them fool you when they say a free \"consultation\".",
            "date": "2017-11-03 15:47:48"
        },
        {
            "review_id": "__l9GDtkgLWYBYq-t5zs5g",
            "user_id": "GVpKw6seyGCGAcpkuWug7g",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 2,
            "funny": 0,
            "cool": 0,
            "text": "I think the bad reviews here are almost malicious and are a 180 degree difference from my experience at this place. My experiences at Wburg Smile Design: I have always, repeat... every single time: been informed every step of the way how much something would cost and how much my insurance was going to cover. No one has ever been pushy with me about what procedures I needed to get or didn't need to get. I'm sorry to say it but most dental plans suck and barely cover anything - so this is the real problem. But in cases where my plan didn't cover something I was given a pretty steep discount. I have had bad experiences with dentists, doctors, and hospitals before so I know what an actual bad experience is. This place is not that. If you aren't sure how much something will cost or if you really need a procedure, just ask. I have been coming here for about 5 years and have never had what I'd consider a bad experience. No one has ever been rude - in fact far from it and my teeth and gums are better than they were before I started coming here.",
            "date": "2017-10-24 15:57:20"
        },
        {
            "review_id": "28hn-tt-r-9Gw0-XF77gXw",
            "user_id": "IlNqLlggyTaOczD-FKHrXQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 5,
            "funny": 0,
            "cool": 0,
            "text": "This is absolutely the most comfortable i've been at a dentists office before. Natalie at the front desk is caring and sweet and when I was nervous about getting certain work done, she recommended I come in for a 2nd review and it absolutely put me at ease. Kelly the dental assistant is also extremely sweet and caring. \n\nThey have a great deal where for $350 you get two cleanings a year and 15% off any other needed services. I think this is fantastic value, and it also includes the above recommended examination outside of the cleaning, just to get an opinion.",
            "date": "2017-08-09 15:25:36"
        },
        {
            "review_id": "o_AAQ-qa3vrou5ZxtRejSg",
            "user_id": "6htkgsj1_yKtNka_Q42mjA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "I had a wonderful experience with this office. The dentist made my smile look wonderful again, and the administrative staff were professional and courteous. They helped me over the course of two days to resolve a billing/insurance issue that I was dealing with, and were extremely patient and understanding! I highly recommend this place.",
            "date": "2017-08-03 22:14:15"
        },
        {
            "review_id": "qUkAnqqGBFqyS5qJrOdjqg",
            "user_id": "8JMLrvfhWwa5Txv-LalZMA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 5,
            "funny": 0,
            "cool": 0,
            "text": "Agreed with negative review below. The staff that is constantly up-selling you on getting more work done. This isn't what medicine is supposed to be about. Beyond being pushy the staff doesn't do any diligence to coordinate with the insurance company to make sure you are covered. This is the only medical experience I've ever had where you're constant guessing what the price is. Ludicrous. Wish i would have read the other negative reviews below. I don't make it a practice to write bad reviews because I know most people try their best but this is a worthwhile exception. Find another dentist.",
            "date": "2017-07-10 20:25:25"
        },
        {
            "review_id": "m041oTceaFwJxyTaT3HN4w",
            "user_id": "qOfyba1cHrzivzuNDZD-ZQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 4,
            "funny": 2,
            "cool": 0,
            "text": "Wow. I am shocked to read these bad reviews! \nI have NEVER felt taken advantage of here, and I am a pretty shrewd and informed consumer. \nI have been going here for about 4 years (started with a groupon cleaning and now they have done lots of work for me) and have always felt the dentist/owner (Dr. Mapes) has lots of integrity, does good work, and that the staff is responsive and competent. \nI have never felt over-charged, lied to, etc. And I appreciate the quality of Dr. Mapes' work and that of his staff. Sad and strange to read these reviews- although you never know with Yelp. These angry people are probably vendors who feel they got stiffed or something...",
            "date": "2017-05-19 17:55:30"
        },
        {
            "review_id": "Fw_xrzLos6HREYwpqN6YoA",
            "user_id": "96virpuQTVZPU5cRB5SHZw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 5,
            "funny": 1,
            "cool": 0,
            "text": "Seriously, one of the worst dental experiences I've ever had. Staff is misleading, I went in for a root canal and the quoted price was $1000. I began receiving invoices for additional charges, which I'm still on the hook for. Do yourself a favor, find another dentist.",
            "date": "2017-05-02 02:04:29"
        },
        {
            "review_id": "miRpFYjEXxy3t-VQNH2VKA",
            "user_id": "Y8QrFuXOWkhnt7-ujTK1AQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 12,
            "funny": 0,
            "cool": 0,
            "text": "In short: SCAM. \n\nIf incompetent dentists who will tell you you need work you don't actually need, do a terrible job and then overcharge you for it is what you're looking for then this place is for you. \n\nLike many other reviewers, I was told I had cavities I didn't have. Too bad I was late to find that out. Had to go back a few times to fix the fillings and the dentist still didn't get it right. I was told one price and then two weeks later that price had more than doubled.  Don't be fooled by the positive reviews. There are enough terrible reviews here for you to be suspicious of the great ones ( this is a good yelp rule in general). \n\nI've never been this mad with a doctor/ dentist before in my life. But this goes beyond incompetence. Like another reviewer, I also want to report this place to the ADA for unethical behavior. \n\nDo yourself a favor and stay away from this place.",
            "date": "2017-05-01 14:32:09"
        },
        {
            "review_id": "RXPGMxvxlqd0nYJOUAITmg",
            "user_id": "zv8ajW1ujuWkQRJW3aACsg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 2,
            "funny": 0,
            "cool": 0,
            "text": "After being a happy patient for a couple of years I was very upset when I had to write a bad review from a terrible experience a couple months ago. However, I was contacted by the owner and after talking about it and making things right, I am going to give this place 4 stars for now. I am going to give this place a second chance and see how it goes. I really appreciate the owner reaching out and dealing with me directly. It shows professionalism and that they do care. Before the bad review a couple of months ago, I will say, I really liked the service and thought the hygienist was great. I hope the service is comparable when I go back and I can switch this to 5 stars. Thanks!",
            "date": "2017-03-27 21:23:53"
        },
        {
            "review_id": "CEoHwr24_8lAgvPqFMfL6A",
            "user_id": "oTdp6_xEi_18hRp17F6TZA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 4,
            "funny": 0,
            "cool": 0,
            "text": "Professional and helpful. Helped me with a very painful root canal. Front-desk staff was cery friendly and transparent with costs and payments and very helpful in finding appointment times. The procedures themselves went very well despite the pain and I would trust them to do more work on my teeth and to advise me honestly. Great place!",
            "date": "2017-03-27 18:12:52"
        },
        {
            "review_id": "nz1caGLKNPQtjVD57qe_mA",
            "user_id": "jx_XRSDWOc95Zvts98IPCA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 8,
            "funny": 0,
            "cool": 1,
            "text": "STAY AWAY! Like many other reviewers I was told had cavities when several other dentists saw nothing.  I was stupid and got three fillings there. I asked how much it would cost me and was given a price. I paid in full.  Two weeks later, I receive a phone call saying I owed 3 times that amount. Now I have to pay for it or will have my credit rate lowered (that was the threat from their debt collector).\n\nOh yes, and I also had to have fillings (all of them!) redone (in a different place, of course). \n\nThis place is a total scam. They must have paid for the good reviews. Do not ignore all the really bad reviews.  They're real. It's always suspicious when there are only great and terrible reviews. \n\nI like to read reviews and I thought people could benefit from this. Hopefully you won't go thru the same thing. These people just want your money.",
            "date": "2017-03-20 19:10:07"
        },
        {
            "review_id": "nksfm37Q05aeIza96LLtrg",
            "user_id": "m2NeT3Sbd7zdTpddPDejxA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 4,
            "funny": 0,
            "cool": 0,
            "text": "It's amazing how many people are having the same bad experience here. I came in for a cleaning and thats when they got me. I recieved painful, expensive, poorly done work that wasn't nessasary. This place is untrustorthy and I will be complaining to the American Dental Society, Commission on Dental Accreditation and everyone I know about this place in hopes that noone goes through the same thing I did. Do yourself a huge favor and go somewhere els.",
            "date": "2017-03-19 19:46:18"
        },
        {
            "review_id": "7Wm0fijEPfk97NA9g4PWFA",
            "user_id": "-GBLzfwoqnwPuP7RwdPqpA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 6,
            "funny": 0,
            "cool": 2,
            "text": "Please do not go here. You will regret it. Do not be fooled with the modern waiting area and friendly receptionists. The dentists do not know what they're doing. \n\nI went to Smile Design during the spring of 2015 for a check up and cleaning. My last dentist appointment was a year prior to this and decided to change because of proximity to home. The initial dentist at Smile Design recommended a crown replacement (which wasn't bothering me at all by the way) but she suggested it was corroding and a small cavity filling on another lower tooth.\n\nI decided to go ahead with both recommendations. Big mistake. The crown fitting took 5 times (a different dentist saw me) and then once it was placed, I had to return three times within 6 months because it kept falling off. One dentist even recommended that I don't chew on the side of the crown which was ridiculous. I chewed on the previous crown for ten years with no issues. AND...where they drilled my cavity (which was done by another different dentist) I have continued sensitivity issues to this day. \n\nI went back to my old dentist who is a well respected dentist in New York and a teacher at NYU Dentistry and on the Board of the American Dental Society and he said that first of all, there was no reason to replace my crown. It was perfectly fine. And the drilling was done too close to the nerve. He has to replace my crown and he already re-drilled my cavity to place a sealant. \n\nI filed for a peer review with the American Dental Society and Dr. Mapes' office never returned the signed papers. I lost the case because too much time lapsed. Now I have to pay for another $2,000 crown procedure and I already paid another $600 for the cavity re-filling. \n\nClearly, this was a money making scheme and the lack of professionalism and experience was very very clear from this experience.",
            "date": "2017-02-12 14:07:01"
        },
        {
            "review_id": "MFc3_Ziz99guonKR0bt3DA",
            "user_id": "eNv1Yhk7F8REKf76jeSDZw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 9,
            "funny": 0,
            "cool": 0,
            "text": "There are countless other reviews on this yelp page detailing this scam artist's practice of filling cavities that don't need to be filled. What kind of horrible person does that for money? The reason I took the time to write a review is to warn others in the hope that they will avoid the pain and embarrassment of falling victim to a scam. It infuriates me every time I remember this experience and know that there are two expensive holes in my teeth that never needed to be drilled. If my reviews save even one person from giving money to this awful business it was worth my time.\n\nAlso, you'll notice that in his response he accuses me of lying about the cost of the dental work I had done. My cleaning was $200, and I had two cavities filled at a cost of $360 each, which brings my total cost to $920. Of course the kind of person who performs unnecessary dental work on his patients to buy himself a luxury car wouldn't hesitate to lie about the cost of his services.\n\nBurn in hell you piece of shit. Karma is coming for you.",
            "date": "2016-12-31 20:52:15"
        },
        {
            "review_id": "ZfaTi_xonACYp3HMnr5jew",
            "user_id": "zv8ajW1ujuWkQRJW3aACsg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 10,
            "funny": 2,
            "cool": 1,
            "text": "This place will take your money and the owner is the worst business owner because he doesn't deal with clients directly. Their policy is undisclosed and it is a fraud! Do not make any appointments for this awful dishonest practice or you will lose all of your money and they wont care!",
            "date": "2016-12-17 16:36:19"
        },
        {
            "review_id": "6bEB1cUkWG9jVODpDPPziQ",
            "user_id": "bxXeiGUrbMt0UjFu4CCfBw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 10,
            "funny": 3,
            "cool": 1,
            "text": "I agree with all of the other reviews. I purchased a Groupon to have my teeth cleaned and was told I needed $1500 of work. I declined to have any of it done and saw a different office a couple of months later who told me I didn't need any of it. Bunch of scam artist and the doctor thinks who the hell he is. \nNot a fan and I'll never be back along with 90% of the other reviewers. Even how he replies to some people who are complaining here on Yelp is comical for a business owner. People complain and he pretty much says \"see ya. Don't let the door hit you in the ass on your way out\".... good luck staying in business guy.... might have to trade the Benz in for a Kia soon. \n\nCheers",
            "date": "2016-10-12 04:38:26"
        },
        {
            "review_id": "51_YdlWG6SBxksBDepxeAw",
            "user_id": "5MQvbF3YnqUxnaTAZRzGVQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 2.0,
            "useful": 1,
            "funny": 1,
            "cool": 0,
            "text": "Got a groupon and the cleaning was great. (Hence the two stars). It was my first time there and I'm always cautions about new dentists. After the x-rays I was told by the dentist that I had 6 cavities to be filled. I said ok thank you and then I returned to my previous dentist when I visited my parents and I got x-rays and an exam just to make sure. Guess what. No cavities. None. I just have naturally deep groves in my teeth that get stained easily. Just be careful, it's a nice office and they need to pay their rent...",
            "date": "2016-06-15 04:41:55"
        },
        {
            "review_id": "ZkHfHdbphB8U5M6gzsplcQ",
            "user_id": "x6S-rTVrT-VaWW6wrI7n7Q",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 9,
            "funny": 0,
            "cool": 0,
            "text": "Do not go here. Find another dentist. If you were having second thoughts or perhaps you wanted to just get an idea of what others thought...let me assure you, YOU SHOULD find another dental office.\n\nWilliamsburg Smile Design will royally screw you when billing time comes. They have super fancy offices, so I suppose they are trying to recoup on costs for that?\n\nSat down with a hygienist who tried to shame me into getting pricier work done. She also pulled out a few scare tactics like \"I just don't want to have to tell you one day that we will have to cut your gums open\"....My choppers don't have that celebrity sparkle, but I know for a fact that i'm not on the brink of periodontal disease. Also, you will never have to tell me that one day because i'm not coming back.\n\nI had a VERY basic 20/30 minute cleaning (which normally runs between $60 - $100) but they billed my insurance for a scaling/root planning- which costed $225. If you aren't familiar -- that means I was billed for a DEEP CLEANING; which normally takes 1-2 hours over the course of 2 separate visits. \n\nAdditionally, I was billed $225 for a \"Comprehensive Oral Evaluation\"- a procedure that normally prices in the range of $60. I had my x-rays sent over from my previous dentist because they were done only 2 months prior, the hygienist reviewed them but never checked for oral cancer and never examined my neck and jaw for abnormalities- just continued to tell me how much work I needed while she performed the VERY basic cleaning. \n\nI did not have x-rays done AND I didn't have a complete \"comprehensive oral evaluation\"-- but was billed $225?? \n\nAlso- exams AND cleanings are the same price, ehh?? Really feels like a scam and i'm feeling like an idiot for not doing more research on them before making an appointment. Don't make the same mistake I did.\n\nUnless, of course....you have a shit ton of money to spend out of pocket for subpar dental care? Even if you have insurance, they will code procedures accordingly to not only squeeze your provider for bucks but you as well. Be careful, even if your insurance covers 100%-- it could jack up your premiums and/or max out your plan.",
            "date": "2016-06-04 02:17:07"
        },
        {
            "review_id": "hrlcihFRsvvZwJUEkaoy_Q",
            "user_id": "7hocoYPx620g_V_ij0Q3dw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 2,
            "funny": 0,
            "cool": 0,
            "text": "I enjoy coming to Williamsburg smile. It has a nice, open energy and the staff is polite. \nI came in suddenly (zocdoc)for 2 wisdom teeth to be pulled ASAP. I came back the following week to have them pulled and Ian was very efficient and nice. If I had a stop watch he had them both pulled within 20 mins. \nI just recently had my cleaning done and she was so very kind and personable. I was pleased. \nThe only downside I saw was wanting to give me a X-ray for 1 last wisdom tooth I have. I declined until after my travels and I felt I was being pressed about it. \nAll in all, I would recommended Smile. My experience as a client is that it is up to par.",
            "date": "2016-05-03 03:27:10"
        },
        {
            "review_id": "NlhnnSCngWPGy6XDbm4few",
            "user_id": "GFW_BAfQ5c4RvGzFxSH4Rg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 5,
            "funny": 0,
            "cool": 0,
            "text": "SCAM! They are a rip off and try to charge you unnecessary amounts of money for nothing!\n\nI went to Williamsburg Smile Design for a cleaning. They took x-rays of my teeth and told me I had 2 cavities that were in between my teeth. When they showed me the x-rays, I honestly couldn't even see the cavities. Then they told me I would have to pay them $360 per tooth to fill the cavities, equaling $1440.\n\nI took the x-rays to my regular doctor in PA who said that the cavities were so small that it would do more harm than good to fill them.\n\nThank god I showed the x-rays to my other doctor. I will never go back.",
            "date": "2016-03-21 18:17:25"
        },
        {
            "review_id": "SfQs-esHQdEzX70zf6LRjw",
            "user_id": "Ow9uF8OyojbDeaugaOmJvA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 4,
            "funny": 0,
            "cool": 0,
            "text": "I contacted this office to make an apt and check my insurance. \nThe receptionist was very polite on the phone and quickly took down my information. \nShe assured me she would call me back.\nShe did not. \n\nThey next day I called again, and she apologized but she had not gotten around to it yet.\nI offered to call my insurance myself to try and be helpful, it only takes a few minutes really, but she declined and promised to call this time.\n\nThree days passed and no word.\n\nI took the liberty of making my own appointment on ZocDoc. \nI show up for my 4pm apt, confirmed via email that same morning.\n\nI WAS TURNED AWAY FROM MY APT!!!!!\n\nReason being... they had a 3pm patient who was running late so they put them into my slot.\nUmmmm....WHAT?\n\nI asked to speak to the office manager, who in turn provided a completely different explanation of why I was bumped off the schedule.  She stated that ZocDoc sent an automatic confirmation & the service does not account for the type of appointment booked, ie. cleaning vs. full consult, xrays, etc. They decidedly cancelled my apt, on their own accord without my approval, because they were not sure what I needed done??? \n\nThis is a highly unprofessional way to run a practice. This is NYC, we are all important, we are all busy, and we all want things done yesterday. I took the time out of my day to go to the dentist and was utterly refused at the door. WOW!\n\nLastly, I got an alert from ZocDoc to my phone with a penalty for \"MISSING MY APT\"\nI called ZocDoc to explain and they notified me that the office reported me as a \"NO SHOW\"\nHow sneaky and dishonest! That is a flat out lie.\n\nYou can apologize if employee is busy, and you can motivate them if they are lazy, but you can not unlearn dishonesty. A liar is a liar. \n\nI can not speak for the skills of the dentist, but if his office staff is a reflection of him... \nVERY POOR\n\nWhat a waste of time!",
            "date": "2015-11-20 23:42:54"
        },
        {
            "review_id": "C_mq1XVQNz71wSyGD2kY0Q",
            "user_id": "Cov29C_j3qpzjr3KIF9-1g",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 1,
            "text": "I had a wonderful experience with Dr. Mapes. I visited this office because I was experiencing tooth pain. Not only were they able to see me within an hour of my call, they were able to extract my wisdom tooth in 5 minutes! I was in and out in about 30 minutes. It was great. I was clearly nervous about having my tooth pulled unexpectedly, but Dr. Mapes was very calming and made me feel at ease. I just went back for my one-week follow-up appointment this morning and, again, was in and out super quickly (~5 minutes). Everything looked good and they sent me on my way. Great place. You even get to watch Netflix while you wait :)",
            "date": "2015-10-05 17:02:48"
        },
        {
            "review_id": "sDI_lGs0tyh7J8Crovu7gA",
            "user_id": "qI7F2rvvTbZ_FSr8kpKqmQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 2.0,
            "useful": 8,
            "funny": 0,
            "cool": 0,
            "text": "I went there for a cleaning only. The hygienist is quite rough, but she did a good job. The dentist was also nice enough, but they are there to SELL you. I'm 32 years old, and no one ever has suggested I might need braces. Yes, my teeth are not perfect, but it's not a huge issue if I keep up with cleanings, and I do. However she insisted I need invisalign. Um, no.\n\nI have a basic cavity I need filled, but it's not pressing. I asked how much they charge, and they said it was $350. What? That's crazy. I know their rent is high, but there are other dentists in the same neighborhood that charge much less. \n\nIf you get one of the cheap groupon deals for a cleaning, why not. But I wouldn't even consider making this place my regular dentist. I'll be going back to iSmile a few blocks away- which I also found through a groupon.",
            "date": "2015-06-15 19:14:03"
        },
        {
            "review_id": "bGQf5IiPPmkcMQvNaxZyJA",
            "user_id": "cnN5PRHtsHKTGNjSagVqAQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "The office was lovely and the staff was pleasant, however my appointment was for 6pm and I didn't actually get seen until 7pm. I understand if people are running behind (especially with late appointments), but I had left work early to make it there on time, so a bit of warning would have been appreciated.\n\nI went in for a cleaning and to have them look at what I thought was either a broken tooth or a filling that perhaps had fallen out. (Seeing I had never been there before, I wanted to experience a cleaning before letting them do anything else and I'm glad I took this approach).\n\nThe cleaning was done by the dentist and performed with a waterpic-like tool as someone else had reviewed. While the dentist was nice, I too have had much more thorough cleanings done elsewhere. They also took x-rays and told me I had another cavity along with this one tooth where the filling had in fact fallen out. They asked if I wanted both fixed that day, but I opted just to wait. \n\nWhile checking out they quoted that to fix both teeth would be around $338 which seemed extremely high seeing how I luckily have really good insurance. I ultimately decided to just go back to my dentist in the city who not only told me the other tooth was fine, but fixed my partially broken (it did not completely fall out) filling for just $75. I had a suspicion my insurance was better than what they were saying and am glad after reading more of the reviews that I trusted my gut and went elsewhere.",
            "date": "2015-05-04 19:51:04"
        },
        {
            "review_id": "0OguqJ5WhGxrC8J37a0fSQ",
            "user_id": "alO-AxaNlgf_b8fOklaLAA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "Friendly professional staff! The office was really cool, prob the most chill environment you could expect considering its a dentist office. Also they really cater to the patients. Would definitely recommend.",
            "date": "2015-03-18 23:00:08"
        },
        {
            "review_id": "Xwj9rQ_iQP9VtjWQvQOY3Q",
            "user_id": "2KX4UVpV_T3EuUfdwPAFJw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "Dr Lin, - a professional dentist gave me, who is a dentist fanatic, a great cleaning! He also listened to my needs addressed them appropriately, tools were clean, office nice, staff pleasant.  Would recommend. Tip- can negotiate a bit if you are on a budget. It really helped! :)",
            "date": "2015-02-21 18:28:23"
        },
        {
            "review_id": "Ki0IsjqR43WiZ04-aE7JDA",
            "user_id": "_9RImgiGEpYQnMIj-1zGIg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 6,
            "funny": 0,
            "cool": 1,
            "text": "My review is for my experience about 2 or 3 years ago. \n\nDid they have a nice office? Yes\nDid they have a cool young staff appropriate to get along with the people of the neighborhood? Yes\nDid they have helpful payment plans for those that cannot afford regular dental care? Yes\nBut like many Dentists in the New York City area they told me I had cavities, 3 cavities to be exact when I did NOT have any cavities. As I find out, by another dentist, this is a habit of new practices to help supplement their heavy dept by filing cavities when in actuality the patient's teeth are fine.  This happen to me as well. I have perfect teeth, I will pretty much always have perfect teeth because of a treatment I was given as a child. I'm glad I know this because I had to go through 4 dentists until I found one that didn't try to over charge for services I didn't need. \nIt's so bad to think that someone you are supposed to trust for your health care is actually milking you for money.  I am completely disgusted.\n\nAnd just so you know, when you look at you X-rays and you don't see any black spots or holes in your teeth it means you have no cavities. Cavity just means hole, there's a hole in your tooth. It will show up as a solid black spot, I promise! It's just that easy to know if it's really there.  Knowledge is power people!!",
            "date": "2015-02-21 00:26:48"
        },
        {
            "review_id": "uHCYupTiOkJ6l2k-rY9qag",
            "user_id": "xn4pCzpLErzBxf2ZW7K7SA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "Everyone is so friendly, the office is clean/modern and they follow up on appointments.",
            "date": "2015-01-22 19:18:09"
        },
        {
            "review_id": "NHI6rwHOmMjHw0rLeC5L1g",
            "user_id": "TVMuLtm0DTg_LaFa0QZKPQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 3.0,
            "useful": 1,
            "funny": 0,
            "cool": 0,
            "text": "Nice, friendly office and staff. \n\nI saw Dr. O'Connor who also did my cleaning and x-rays. The cleaning was done primarily with a waterpic-like tool, and then a little additional cleaning was done with a standard metal pick tool, then the teeth were \"polished\" with the paste application tool. \n\nDr. O'Connor was nice but I have had much more thorough cleanings done by hygienists at ProDent, Dr. Zipkowitz, and Rosenthal Apa. Usually at these other dentist offices, the hygienist does the cleaning and then the dentist reviews after. I found that they are much more thorough with removing plaque and also they always floss at the end. There is also often an evaluation of gum recession on every tooth done at the other dentists.\n\nOverall it was decent but I prefer a more thorough cleaning. \n\nFinally, note: no cancellations allowed if you buy the living social deal.",
            "date": "2015-01-13 20:15:35"
        },
        {
            "review_id": "aKY_eYQpftvsNrpKHF8XvA",
            "user_id": "2RyYX7jw24ChPxX-y5Y2KA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 1,
            "funny": 0,
            "cool": 0,
            "text": "By far the best dental experience I've ever had. Dr. O'Connor and AnaLynn made my Christmas Eve appointment more painless than actually having to deal with my family. \nBy far the best team in Williamsburg.",
            "date": "2014-12-24 22:29:37"
        },
        {
            "review_id": "nJms6rW_NKUNfr28ePjeag",
            "user_id": "05vJzbFI6wOxgFvfc1_qOQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 2,
            "funny": 0,
            "cool": 1,
            "text": "I came to Williamsburg Smile and Design because of a Groupon I got. The office was very nice, that was the first thing I noticed. It was very modern and clean. The staff was great, very friendly and helpful. The Groupon covered everything and I had no issues. \n\nMy dental hygenist who administered the cleaning, Bianca was great. She did an excellent job and made me feel super comfortable right away. She was telling me stories and had me laughing, how great is that? She was very professional and the procedure was uncomplicated and fast. \n\nThe doctor checked Bianca's work, told me about my teeth, answered any questions I had and was very helpful and thorough. She didn't try to sell me anything, she gave me suggestions for what I could do for my teeth that fits my lifestyle. All in all a great experience. I will definitely return,",
            "date": "2014-11-22 13:45:44"
        },
        {
            "review_id": "Yl0n6xiWSkTxWyvSxGM9ag",
            "user_id": "EfUKBLwwAXAHQPEecxXUdg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 2,
            "funny": 0,
            "cool": 0,
            "text": "I'm a bit surprised by some of the reviews on here because I've never had an issue with any of the dentists who have seen me at this practice. \n\nI still consider Dr. Mapes as my primary dentist but if the scheduling doesn't work out, I see whoever is available. I came to this office after a horrid experience with a dentist in Astoria who botched a crown up so badly, I wound up having gum surgery by a professor at NYU's faculty practice to the tune of about $2500\n\nLuckily, I've never had that kind of experience at Williamsburg Smile Design. I just had a crown put on a few days ago and so far, so good. \n\nFor comparison, I also happened to see another dentist over the summer for a TMJ and sleep apnea consultation who has 40 years of dental experience. He agreed the crown was the right course of action and confirmed that overall, my mouth is healthy and happy. If 40 years of dental experience says I'm in good hands, then I'll trust it!\n\nI hate going to the dentist in general because I've had some really bad ones but this place isn't one of them!",
            "date": "2014-10-03 16:47:48"
        },
        {
            "review_id": "GWnUH3mKIq1OcJJK9x0HSQ",
            "user_id": "giQp-hEGwsVM0AHRRhn8tw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 1,
            "cool": 0,
            "text": "Williamsburg Smile Design was a great experience. The office is clean and very inviting with yummy coffee and snacks to enjoy while watching Netflix in the waiting room. The staff is super friendly and they really know their stuff. I felt so well taken care of and that is a rare feeling to get from a doctors office. I definitely recommend this lovely establishment for your next cleaning or filling.",
            "date": "2014-10-02 20:53:04"
        },
        {
            "review_id": "d6Nx_MV2GIKCJaZNwUALcA",
            "user_id": "4X6ktMyUzdHlOeTmxkoC3Q",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 1,
            "funny": 1,
            "cool": 0,
            "text": "Just had my first visit for a cleaning and emergency exam with Williamsburg Smile Design - and I am thrilled to have found a  new practice for my family!  After a few bad visits to Williamsburg Dental Arts, I procrastinated with dental check-ups and cleanings for a whole year until I found myself in trouble with a toothache.  \n\nI was a little concerned by the negative Yelp reviews, but I realized that most of them weren't about the dental work, but the \"marketing\" and standard practice of \"payment for services rendered\" at all dentist offices. \n\nThe office manager gave me an appt for the same week - and was so kind and understanding that I already felt great about trying a new practice.  I am terrified of dental work and cleanings, but the hygienist, Bianca, was absolutely amazing.  She made me feel at ease and gave me the best cleaning I've ever had (even after a year of delinquency).  Dr. O'Connor saw me within 10 minutes of my cleaning - and reviewed my x-rays with me to discuss things to watch.  Luckily, I didn't need emergency work, but it was definitely a wake-up call to keep up with regular and consistent care!\n\nThe office is in such a great location - with a lovely and calming atmosphere.  There's LCD screens with NetFlix in all the rooms, including the waiting room (not that I waited that long).  Love the front office staff, too!  I am so happy and privileged to join the Williamsburg Smile Design family.",
            "date": "2014-09-27 02:16:53"
        },
        {
            "review_id": "ayNuRwFAaSaXu6SbHtxnOQ",
            "user_id": "SBM5yU-o6lhbfUrlG_w1XQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 15,
            "funny": 0,
            "cool": 0,
            "text": "Writing this as a warning to anyone thinking of going here.\nI first went to this dentist over a year ago for a cleaning, and it was great. Knowledgeable doctor, nice staff, very clean and up-to date equipment. However, this place has recently hired a new manager, my old doctor has left, and things are not how they used to be. \nFirst of all, last time I went in for a cleaning a couple months ago they tried to charge me for my cleaning, and this is WITH my insurance. My reaction was, wait, what?! I spoke with the manager who explained that they accept ALL insurances, but that basically if your insurance doesn't cover their minimum they will charge you extra $$$, which they decide based on their own calculations. (The point is, these people want MONEY, and they are in an expensive neighborhood, and need to cover their expensive equipment.) The manager told me that she would waive the charge this time, and that they would accept my insurance for the fillings I needed to get done on my next visit.\n\nSo I came in yesterday for a 6 pm appointment for the fillings, and the receptionist informed me she's been trying to reach me, (she called me 40 minutes prior to my appointment). She told me I needed to pay $400!!!! For fillings covered by my insurance. Hell no lady. I asked her that if this was the case, why did she tell me on my last visit that it would be covered, and why did she wait 2 WEEKS to get in touch with me? These people have ZERO morals, and they are completely unethical.\n\nThe completely inept and obviously un-educated receptionist trolls have zero manners and I think have no idea how to use their office software, maybe they're not properly trained? The manager was little help as well, saying basically that this is their policy. Whatever, at least own up to your own mistakes. Why waste my time?\n\nBottom line: Don't go here. The manager and the office monkeys give zero shits about you and your health. They are only there to collect your $$$. The nice office might be inciting, but what good will that do when they try to rob you of your hard earned income. No thanks.",
            "date": "2014-09-17 20:01:03"
        },
        {
            "review_id": "_9KkuSTc_VAfru4JxN4mCw",
            "user_id": "bSze1h5HSLOl-wfiP8gYkg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 4,
            "funny": 1,
            "cool": 0,
            "text": "Im with the majority of the reviews for Williamsburg Smile Design. Their business strategy of telling people they need enormous amounts of unnecessary dental work is completely unethical. I had read the reviews beforehand, but figured I'd still cash in my Groupon for a teeth cleaning. I was prepared for the upselling, but boy, it was almost like an SNL skit. The hygienist was very rude and kept insinuating how bad the state of my teeth were (I just went to my dentist 6 months ago who said my teeth were in great condition). And no offense to hygienists, but I'd prefer the dentist to give me a breakdown of what's going on with my teeth when I can look at an X-ray with them and ask questions. Not when you have your hands in my mouth and it just sounds like you're being a mean girl. Furthermore, she was incredibly rough and then had the gaul to tell me my gums were bleeding a lot. Yes, Freddy Kruger, they are bleeding a lot. I think it has to do with you haphazardly hacking away at them. The dentist then came in and went down a laundry list of expensive producers I would need- veneers, crown replacement, cavity fillings. She kept trying to point out things on the x-rays that clearly weren't there.. she would say \"can you see that tiny little fleck of shadow? Oh yes, that's a major problem.\" Bottom line- if you get a Groupon go get your teeth cleaned.. but basically cover your ears for the rest of the consultation.",
            "date": "2014-09-10 02:49:37"
        },
        {
            "review_id": "P2pqwNh672ZUaey26Od_Bw",
            "user_id": "_RJu_8fMzjMZJzOrPbKYZA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 2,
            "funny": 0,
            "cool": 0,
            "text": "My dad was in the dental industry, so I have always received the best of the best when it comes to dental care.  I do no have insurance right now, so I bought the Groupon for cleaning/xrays/consult.  Could not be happier.  Very nice office with pleasant and helpful administrative staff.  The hygienist who did the xrays and cleaning was thorough, gentle, answered all my questions and provided good advice.  The dentist was also very nice, explained everything with no pressure to purchase additional services/treatments.  I had two cavities (eek!), and will definitely make an appointment with Williamsburg Smile Design to have them filled once I return from my upcoming travels.",
            "date": "2014-09-04 20:58:39"
        },
        {
            "review_id": "ejJ1rd1fimKrlebbmIBOFQ",
            "user_id": "5LiUDo8g9Q8PVPAXn__OXw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 2,
            "funny": 0,
            "cool": 0,
            "text": "I am 36 weeks pregnant and had a tooth emergency.  I called Williamsburg Smile Design on a recommendation and they did everything they could to fit me in that morning.  I saw Dr.  O'Connor, a new dentist there, and she was absolutely wonderful.  She was very sensitive to my pregnancy and explained everything she was doing clearly and kept checking in to make sure i was not in pain.  I felt very well cared for and recommend them wholeheartedly! \n\nAnd it does not hurt that the facility is immaculate and very modern!",
            "date": "2014-08-30 12:29:57"
        },
        {
            "review_id": "uSU6l-aB4moTX0ecZqMQvg",
            "user_id": "OZ0wUm_hkw9QXaK1uiRHEw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 1,
            "funny": 0,
            "cool": 0,
            "text": "I've had a good experience with Dr. Mapes although I do wish he was in the Brooklyn location on more than just Mondays (in Court Square the rest of the week).  It's nice to have consistency with staffing, so I appreciate seeing the same person at the front desk when I am there or knowing the person who is helping with financial stuff or even cleaning. It was like that when I first started going there two years ago, and then it seemed like it was different people all the time, and now it seems to be consistent again. I hope so!",
            "date": "2014-08-06 21:39:02"
        },
        {
            "review_id": "cFxoLInaeBDGK6-bkY40xA",
            "user_id": "eNv1Yhk7F8REKf76jeSDZw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 15,
            "funny": 3,
            "cool": 0,
            "text": "AVOID AT ALL COSTS\n\nFuck these people. Went in for a checkup as a new patient and they informed me that I had 3 cavities. I had never had cavities before in my life but I figured that eventually it must happen to everyone. Had all of them filled in one session that was incredibly painful and left my mouth numb with novocaine to the point that I couldn't speak to anyone for a full 24 hours. Not to mention it cost me about $1000 total. \n\nMonths later I went in for another checkup and they said I had 2 more cavities. I found this really weird considering my dental history so I went to another dentist for a second opinion. Not only did the other dentist inform me that I didn't have 2 new cavities at all, but they also told me that the 3 that I had filled previously DID NOT NEED TO BE FILLED IN THE FIRST PLACE. \n\nThis confirmed my suspicion that Williamsburg Smile Design will do anything to get money out of their customers. I should be suing for malpractice, but I'd rather save my time and inform anyone thinking about using them to stay far far away. Also, I've told them multiple times that I have a new dentist but I still receive text messages and emails \"reminding\" me that its time for another appointment.",
            "date": "2014-06-03 18:33:17"
        },
        {
            "review_id": "wZ70gyu5AgCrORfDDqYgnw",
            "user_id": "dZ9eM__ceNP7gbF9SNqZ7A",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 10,
            "funny": 2,
            "cool": 0,
            "text": "Have to update my first review to warn others that these people are sharks!\n\nThis business epitomizes everything that is going wrong now in Williamsburg: 100% focus on the $$$ and very little on actual human beings.\n\nWARNING: do NOT give them your credit card details (if you even bother to go here to begin with). I canceled my appointment and was charged $100, WITHOUT anyone ever informing me about the charge. Best part of it was that it was supposed to be my second appointment here, part of my Groupon = ALREADY paid for. I contacted them, to get an explanation and they told me that their policy is to charge $100 you if you cancel an appointment, as a courtesy to other customers who may have missed the appointment because of this. Uhhhhhhm??? I ALREADY PAID for it, what is that supposed to mean? It's as if Amazon charged you extra, because you didn't pick up your parcel when it got delivered, and other customers may have missed a shipping spot because of you. What the hell, you purchased the thing in advance, if you don't want to pick it up, it's your problem. Why an extra charge?\n\nWell, only sad not to be able to return here anymore, as it was convenient for where i live/work. So don't be fooled by their neat appearance, this place is all shine and no substance.",
            "date": "2014-04-11 22:45:41"
        },
        {
            "review_id": "edZJ1R1tPsKZhneC28xghg",
            "user_id": "fWZLPnwDSJ78piQNiaDR5Q",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 8,
            "funny": 0,
            "cool": 0,
            "text": "Used their groupon offer for teeth cleaning and check up. I told them I just got my braces taken off. Not only both the doctor and the teeth hygienist were rude, saying my dental work wasn't that good and my teeth are not perfect, which was extremely unethical and immoral. They told me I have 12 (twelve) cavities, plus needed a crown put in. Knowing I didn't have an insurance and paid cash they probably assumed I would just pay them almost 10K they quoted me. Thank God I didn't. A week later my regular dentist told me I have ONE starting cavity that needs attention and I have nothing major to worry about and during my orthodontist check-up ANOTHER dentist told me, I don't have all those cavities. So they clearly lied.\nShame on you, smile design. I will never be back and I will tell all my friends and clients to stay away from your shady facility.",
            "date": "2014-04-03 02:44:06"
        },
        {
            "review_id": "XUGjLBhy64suepXo7uYbKg",
            "user_id": "oNl7N077nDFrhCbOojQKvQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "awesome dentist super chill very attentive. listens and accommodates her patients. hygienist are rad. all the staff act like people and not robot doctors which makes the whole visit seem less stressful and annoying. if i had to say one negative thing they are kinda insecure seeming and blow up your phone with texts and emails and voicemails asking you to confirm over and over. its like yo i made the appointment and told you already i'm coming relax imma be there but whatever thats more weird than negative. my theory is that its a means to keep the receptionist busy. either way def a good modern clean quality dentist.",
            "date": "2014-03-23 09:07:13"
        },
        {
            "review_id": "jYOyIXBCIUGuhe4Jj83Epw",
            "user_id": "6a93JR1eKp9fDzJyq-z9uA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 14,
            "funny": 0,
            "cool": 0,
            "text": "A follow up from my review last year:   My experience was almost a full year ago.  \nI wrote about headaches and grinding in my sleep as a result of Dr. Mapes' aggressive and unimformed removal of deep metal fillings when it was not necessary.  Since then, the headaches have only gotten worse, and have progressed to extreme infection in my jaw bone and constant earaches.  Apparently in his rush to finish my fillings speedily (half an hour to do three deep fillings) --bacteria was left inside the tooth.  I am usually not a mean person --however, my unlucky venture based on positive yelp reviews has changed my life in ways I could never imagine.  Chronic pain and discomfort --terrible headhaches.  And...I am told now the only way to get to the infection is to pull the tooth.  I will sit on that a little.....\n\nPlease think twice.  To this day, Dr. Mapes never apologized or contacted me with any care or concern.  His ego is huge and he's all veneer (no pun intended...)--behind the office with fancy coffee makers and lots of flat screens, the substance is quite thin.",
            "date": "2014-03-02 00:06:05"
        },
        {
            "review_id": "X0r5-pxLm9u4W7XViy7zXw",
            "user_id": "MWizYQ4H7fAXOzDvUOnFsw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 7,
            "funny": 0,
            "cool": 0,
            "text": "Terrible.\n\nImmediately was told when I walked in that there is a new office in LIC.\n\nThanks but how does that affect me?\n\nWasn't notified my dentist wouldn't be there and had a new person looking at my teeth.\n\nCheck up and cleaning went well. New dentist seemed to be nice. \nUpdated x-rays. All good right?....not so fast...\n\nHad a consultation for invisalign and was told very little, I agreed to do impressions so I could get a plan and animated video of the timeline to correct bite and straighten teeth.\n\nI was then phoned a few days later saying my insurance didn't cover orthodontics. Next day they called to tell me the video wouldn't be sent to me until I completed my deposit of $1800. This was the first time ever anyone told me about an $1800 deposit.\n\nNot only that, the tone of the email and communication was snarky and somewhat uppity. I have no problem with being a cool modern place but don't let that come out in your customer service.\n\nI had high hopes to have a great dentist in WIlliamsburg near my home, but the lack of transparency and overall attitude left me with a bad taste in my mouth.\n\nI'll take my money and referrals elsewhere.",
            "date": "2014-01-15 22:13:10"
        },
        {
            "review_id": "ksqsuMcRqkvsOV5SuwBrgg",
            "user_id": "vNv7mVV1JD0_dRP-Z6yQaQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 1,
            "funny": 0,
            "cool": 0,
            "text": "I've had two cleanings, a filling, and a full Invisalign treatment. Never a wait for an appointment, friendly nurse, and convenient location. Dr. Mapes is friendly, personable, and answered all of my ridiculous questions.  I'll be going back for a crown soon too, you crazy yelpers",
            "date": "2014-01-14 02:10:22"
        },
        {
            "review_id": "GYamfcPpkyJNtNdj6fO5Gw",
            "user_id": "Eeak4HpBKmhoBxBoy8e-fQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 2,
            "funny": 0,
            "cool": 0,
            "text": "You want your dentist or any medical professional to have all the latest equipment and knowledge. This is your place. Had checkup, cleanings and Invisalign so far. \n\nI'm surprised to read the reviews that are less than 3 stars. Dr Mapes is very nice, knows his stuff and the office is new, clean and the people that work there are chill and nice. \n\nSeriously, the neighborhood is flooded with eastern Europeans with ancient equipment in store front type locations, much of Manhattan too. Go to WSD because going to the dentist already sucks, why make it worse?\n\nI'll admit, too many reminders what with phone calls, texts and emails, but if you ask, they'll stop.",
            "date": "2013-12-13 21:32:05"
        },
        {
            "review_id": "9FtGmwpR9Set0W5ONSKS2A",
            "user_id": "ZhhI9F6EtGY2G-P8vnn7fQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 2.0,
            "useful": 9,
            "funny": 0,
            "cool": 0,
            "text": "I went here quite a while ago.  I wanted it to be a great experience, but it was not.  Dr. Mapes is very nice, but reading some of the other poor reviews I realized it's kind of my obligation to add my poor experience as well.\nI was told I need several fillings taken care of and a crown put on.  well, I did warn him that putting crowns on my teeth is not a good idea because I've had multiple experiences when getting crowns where it kills a nerve and then I need root canal.  It wasn't as much that that's exactly what happened and I ended up needing to go to a periodontist to get major surgery done.  It was extremely painful and expensive.  *sigh*.  Dr. Mapes was nice and expressed his regrets. I liked him very much, but unfortunately the whole process was not at all stress or pain free.  I've had a ton of work on my mouth and at this point I know who's the right Dentist for me.  This is not the right place for me.  The Office is very nice and sleek however I really dislike the modern outfit where there's no spit tray with water right there.\nThey say it's better to fight bacteria spread this way, but, I would think if the area is cleaned well with proper products between each patient it's worth staying with what works best.",
            "date": "2013-10-23 19:49:08"
        },
        {
            "review_id": "UvjW4sgL2S4LkZAJ8fzeng",
            "user_id": "wQ5UzDHgXkz-2YS5SfhKTA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 13,
            "funny": 0,
            "cool": 0,
            "text": "I went to Dr. Mapes after buying a Groupon voucher and seeing good reviews online.  The office is very nice and in a convenient location, and both the dentist and the receptionists seemed nice.  I went in for a consultation before I had the Groupon cleaning, because I was having some pain in my jaw and wanted to get it taken care of quickly.  Dr. Mapes took some xrays and said that the problem was a cavity.  I came in the next day and had it filled.  \n\nDr. Mapes hit a nerve while giving me anesthetic, and it was the most painful injection I've ever had.  (After the filling, I couldn't open my mouth wide enough to eat regularly for 10 days.)  The filling felt very strange afterwards - the shape was very different than pre-filling, it had edges sharp enough to cut my tongue on, and my teeth didn't close right.  I went in the next day to have him file it down, and he basically told me it wasn't his fault that the filling felt wrong.\n\nA few weeks later, I went in for my cleaning.  It was the most painful, bloodiest cleaning I've had in my life.  I've never felt anything close to this sort of pain at a dental cleaning before.  The hygenist blamed it on me.  I'll admit I don't floss every day, but I've never had a cleaning close to this painful or bloody before.  \n\nMeanwhile, the initial pain I came in for hadn't gone away, so I went in for another appointment.  Dr. Mapes took more xrays and said that there was actually another cavity in a tooth two teeth down from the first filling.  I asked why he didn't tell me about that one the first time, and he didn't have much of an explanation.  He said there was also another cavity on the other side, so I went in and had those two cavities filled.  They felt strange, just like the first one.\n\nThe pain still didn't go away, so I went to my long-time family dentist for a second opinion while visiting home at Christmas.  She took xrays and examined my mouth.  She then said that the three cavities Dr. Mapes filled were the worst examples of amalgam fillings she's seen in her career.  She explained that the cavities he did weren't even sealed.  Besides that, one of the cavities he filled was in a tooth that didn't even need to be filled!  The tooth that was actually causing me the pain was BETWEEN the two teeth he filled.  The second dentist repaired all of Dr. Mapes's work, at great cost, and said I might lose the teeth eventually because of his shoddy work.  \n\nWondering why Dr. Mapes appears to have such good reviews?  He gives you a whitening toothbrush on the way out the door if you write a good review while you're checking out. \n\nIf you're just going in for a cleaning, whitening, or something basic, I'm sure this office will be ok.  If you're having a cavity filled or anything more serious than that, DO NOT visit this office.  Save yourself the pain, trouble, and money.",
            "date": "2013-10-18 04:01:06"
        },
        {
            "review_id": "pMLY2jQUCnKxkT1jps-PUw",
            "user_id": "6a93JR1eKp9fDzJyq-z9uA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 11,
            "funny": 0,
            "cool": 0,
            "text": "Had a check-up.  First time there.  I was told I had three cavities and a fourth that \nneeded a crown. Thank god I held off to do the crown last.  \n\nI went to have my cavities filled.  Dr. Mapes took out all my old fillings.  My tongue was numb for five days after --he hit me with the novocaine.  I never would have had all the fillings done had I known how dangerous it was to go so close to the nerve when taking out old fillings.  Regardless, the next day I contacted the office to tell them I was in tons of pain and couldn't chew or close my teeth.  Dr. Mapes told me to come in, and he looked but dismissed the pain and told me to wait longer.  I did.  Still nothing, but i was in excruciating pain and couldn't eat.  I went to my old family dentist who said I SHOULD not have the crown done--that it was not necessary.  And after looking at the xrays it was not necessary to do all of the fillings --to go so deep and take out the metal.  Six months later, I still have terrible nerve issues and now grind terribly in my sleep as a result. I have headaches that get really bad as a result of the nerve irritation from the fillings.\n\nThe place looks great,  but buyer beware of the external beauty.  Don't do it.",
            "date": "2013-10-04 14:23:20"
        },
        {
            "review_id": "5SRDaqnb2PTt5rq6cBVRqQ",
            "user_id": "rdQ0jNgJCJzOCoIQ3Lpo_w",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 14,
            "funny": 0,
            "cool": 0,
            "text": "I had a terrible experience here.  Non-attentive dentists, who explained very little about my Invisalign treatment after they had my money. Worst of all I left with very serious burns on my lips after having the Invisalign hardware installed. When I eventually had my invisalign account transferred to a different practice they were slow to respond and slow to send my outstanding trays. Recommendation: avoid.",
            "date": "2013-09-23 21:45:22"
        },
        {
            "review_id": "u7_x2cmpfoxcubNmeaHzAg",
            "user_id": "dWGNAsaKZglssW4LBZk0aA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "It's difficult to trust a new dentist esp if you have a beloved family one. However, in this case you'll be glad you did. Dr Mapes is a wonderful dentist. WSD is modern and sleek in both its look as well as smooth operation. I've never waited more than 5 minutes to be seen. It is very clean and pretty stylish actually. The equipment is new and current w items such as\nDigital X-rays. \nI pay out of pocket due to no health insurance and find Dr Mapes to be more than reasonable. \nI'm very happy to have fond a dentist that I am happy with.",
            "date": "2013-07-17 14:13:00"
        },
        {
            "review_id": "3fLCrU__DrBjTx3yFElvtw",
            "user_id": "5UfjCiP2USh__-yADfAYSA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 1,
            "funny": 0,
            "cool": 0,
            "text": "I had a LivingSocial coupon and went there for the first time. I had a good experience, the whole personal is very friendly. The receptionist is very nice, Maria( the woman who does the X-rays) very nice as well. The  hygienist ( i forgot her name sorry) did a great job. I had braces and I haven't had a cleaning in more than a year ( my teeth were really dirty). The cleaning was a little painful, but nothing a person can't handle. Doctor Mapes is great, she's very kind and polite. The place is very clean, neat and modern.  I loved the music, they play old school hip hop and you can watch Netflix while you wait. I'm coming back soon to get Silver Fillings replaced with White Composite since they accept my insurance (Aetna PPO). I recent this place if you live in Brooklyn or close to Bedford av by the L train.",
            "date": "2013-06-27 23:02:32"
        },
        {
            "review_id": "gtOt8q1-FGGUSEFLGnEbIg",
            "user_id": "xoq3LIkH2Xh4OIlSTO_fHw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "Using Groupon can be scary sometimes because you never know what to expect, and so often you find out nothing is included and they try to add on services, or the service is just lousy and rushed.  But being uninsured, I decided to go for the $50 cleaning and take my chances.  \nNot only was it not a scary experience, it was also the most thorough cleaning I've ever had.  The staff is super nice, and the office is clean and modern.  X-rays were included, and they went over everything with me.  I was given suggestions for other services that could help me, but not in a pushy way.  They are simply very thorough, informative, and professional.",
            "date": "2013-05-17 20:15:37"
        },
        {
            "review_id": "1Z-iDuB02yvYpVaGR_n-zQ",
            "user_id": "OILk9en32UlCAAXcRNA33A",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "I have teeth that are falling to pieces because of my night grinding (TMJ). I'm impressed with the reconstructive work done by Dr. Mapes on my front teeth. No waiting around and fillings are a painless no-fuss event. It's a very pleasant office and the staff are helpful.",
            "date": "2013-05-17 15:11:31"
        },
        {
            "review_id": "P_igkb9x4VtZUr9U_-jfpQ",
            "user_id": "_HOwzo1k46HBogCUgED8XQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 1,
            "funny": 0,
            "cool": 0,
            "text": "Since moving to New York ten years ago, I have gone through a number of dentists trying to find one that I like. I think I have finally found one. Williamsburg Smile Design is a nice, state of the art looking office with a friendly and efficient staff.\n\nI got some fillings, as well as veneers put on my two front teeth due to some previous dentalwork disintegrating which caused great pain. The veneers looked great, but I was still having some mild pain, so I got a root canal. Afterwards, I was still having mild discomfort, so I wrote Dr. Mapes an email. I was at this point a little frustrated because after a bunch of expensive procedures one of my teeth still did not feel normal. Doctor Mapes personally called me the next day in response to my email, and I went back in for a consultation. Turns out that the new surfacing on my tooth was causing my teeth to grind and cause a little bit of pressure, so he sanded it down a little and made a tooth guard for me right then. A couple of days later, and my tooth feels normal, finally. Yay! Also, bonus points to Dr. Mapes for being a Quentin Tarrantino fan!",
            "date": "2013-03-05 18:52:50"
        },
        {
            "review_id": "Hw86l0QYwkSXSJLjMz_aDw",
            "user_id": "GVpKw6seyGCGAcpkuWug7g",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 1,
            "funny": 0,
            "cool": 0,
            "text": "Never thought I'd review a dentist but I love this dentist.",
            "date": "2013-02-02 19:08:40"
        },
        {
            "review_id": "yhvNlZT78s9dR1pApXMavg",
            "user_id": "dZ9eM__ceNP7gbF9SNqZ7A",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "Went in for a general teeth cleaning and was happy with the process and the result. Studio is clean, everyone is professional and efficient, and the location is very convenient being a few blocks from the subway.\n\n4 stars instead of 5 for two reasons:\n\n1) I got received tons of texts + emails reminders as well as missed calls and voicemails from the studio before the visit. While I do appreciate the technology, one text, one email, one call would have been enough!\n\n2) I felt like they did quite a bit of upselling: deep cleaning, wisdom teeth removal, teeth straightening, were only a few of the procedures suggested. I was feeling as if they were about to suggest to remove all my teeth completely and replace them with veneers, as they were sooooooo terrible. \n\nBut whatever, I am happy with my teeth and don't care too much about the above, so I will definitely come back. I went for a cleaning and got a good cleaning, and that's all that matters to me.",
            "date": "2013-01-18 06:31:49"
        },
        {
            "review_id": "0lIBQcp2eD2fnzQqZ4rWFA",
            "user_id": "MXEFT3vZYil7ZGCfY38UVQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "Came to find this place via a LivingSocial deal for Invisalign. Previous reviewers cite this place as trendy and more like a salon- it's true! Who knew it would feel so ...hip... going to the dentist? Great tunes play as you're waiting to see the doc, comp tea and coffee and Netflix throughout the office. Very friendly staff, and Dr. Mapes is very good at explaining the Invisalign process and keeping you up to date and answering all your questions.",
            "date": "2013-01-07 23:33:14"
        },
        {
            "review_id": "lBXQkjytp0s3W32doqWS9g",
            "user_id": "g1N8G_02qROEB026nrYrmg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "I'm very satisfied with the service I received here. The staff is friendly and professional and I didn't have to wait at all. Bianca cleaned my teeth and Dr. Mapes took the time to go over my exam results with me in a pleasant manner. Clean and modern office with Netflix! I would recommend.",
            "date": "2012-11-27 21:23:22"
        },
        {
            "review_id": "6vTQCRt0U6GqEFkMv2aVkg",
            "user_id": "j0YxvWreqA1dOUKMVvE5KQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "I finally used my groupon voucher for the cleaning package deal. This place is good! May have been the best dental office I've ever been to! Everyone was nice and professional. I had to wait for about 20 minutes but it was okay cos I got to watch some show on Netflix. Yes, they have TV in the rooms (I thought I could watch while they're cleaning my teeth but its not really possible I realized during the session LOL). The place is high tech : Blanca took x-rays and pics then Dr. Mapes used ipads to discuss about problems etc. I found that really helpful...I could actually see high def pics of my teeth and where problems are occurring. My only wish is that I had spit out some stuff during the cleaning, no biggie. Dr. was thorough enough with the cleaning. Other than that I thought the experience was good for a discounted rate. I will come back :)",
            "date": "2012-11-21 18:46:21"
        },
        {
            "review_id": "b2tLxFQglUDUa5_xn4YhVQ",
            "user_id": "j4FywKx52iCxay11TKCL9Q",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "Williamsburg Smile Design is a real find in dentistry. Dr. Mapes worked tediously to complete my root canal rather than referring me to a specialist, which would have been quite an expense. The dentists and hygienists are kind and knowledgable and the office manager is lovely, and goes out of her way to help you sort through the financial aspects of your care. \nI would definitely recommend trying out the office for your dental needs.",
            "date": "2012-11-18 16:21:26"
        },
        {
            "review_id": "HFNN8VxxLDFXZe3x4hyfeg",
            "user_id": "8fDTwQ1HPQk04-kKkCj6hg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 1,
            "funny": 0,
            "cool": 0,
            "text": "I walked in thinking... I can't afford this place. It's super trendy and looks expensive. I've been shopping around for invisalign and have had several quotes. This was by far the most inexpensive.The dentist was extremely nice, so was the staff. They were all super attentive. It really doesn't feel like a dentists office, which is nice. Highly recommended.",
            "date": "2012-09-25 14:59:53"
        },
        {
            "review_id": "CACoAAkAuT2pxtNDO4DCLg",
            "user_id": "VtSkwwoz_MKlUFDHhcLErQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "Very nice experience. Timely and professional. Bianca took great care of my teeth.",
            "date": "2012-09-24 02:16:23"
        },
        {
            "review_id": "2Nb92WhUsvG0FsicdXv9mQ",
            "user_id": "k6HMqD69qSKWs-W0fCn-NQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 2.0,
            "useful": 3,
            "funny": 0,
            "cool": 1,
            "text": "I was told there was a free consultation on the phone but charged $49 following the visit. Air conditioning was not on this past weekend. As for the dentist, I'll need to schedule another appointment with my old dentist out of state so he can compare x rays. This guy insisted my post car accident angled tooth had always been so. Because I had braces but they must have wanted to leave one crooked for interest. Because I'm clearly a dental hypochondriac (who likes going to the dentist???).\n2 stars because I didn't see the regular dentist and he may well be wonderful.",
            "date": "2012-08-21 03:03:56"
        },
        {
            "review_id": "wlelhkqqno7UpCc4Hgjgkg",
            "user_id": "4xS3XdF_ET11tAGdyO4i7w",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 2,
            "funny": 0,
            "cool": 0,
            "text": "I went in just for a general cleaning a few months ago. Everyone was very friendly. The office is super modern but still seems pretty warm. The teeth cleaning was good too - no pain at all, which sounds like it should be a standard but it's not. \n\nI was worried they would try to upsell me on cosmetic work, but that was not the case. I'll definitely be back.",
            "date": "2012-07-26 20:38:48"
        },
        {
            "review_id": "axdmCAOom0y8LdA_ILKQmg",
            "user_id": "DO2gBURZ-8cKtrVZSTiClA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 3.0,
            "useful": 4,
            "funny": 0,
            "cool": 0,
            "text": "Got a Living Social deal and came here for a cleaning and x-rays. That went totally fine, and I thought it was great that Dr. Mapes actually comes in and does the cleaning himself (no offense to dental hygenists, but it was nice to have a dentist who actually felt \"involved\" for once.) \n\nMy problems came up with me agreeing to get a night guard, since this was the second dentist who recommended one to me. It was greatly discounted, so that convinced me to go for it. I had the impressions taken, then when I came back for a fitting, I was told that there was a problem with the fit, that the lab messed up. So I say, okay, I'll expect to come back in a week. No one called me. Meanwhile, I was going through finals, getting ready to graduate, leave New York, was kind of busy. Incidentally, a 40 minute subway ride each way is not ideally how one would spend their time in these circumstances.\n\nI call a couple weeks later, and was told I should have been called because the night guard was ready. I made it clear that I was upset, and Dr. Mapes apologized for his receptionist's screw up, which would have been all well and good, but then I was told the night guard didn't fit AGAIN and that this never normally happens. At this point I was starting to wonder who actually messed up the impressions. I was told this would be rushed, and I said it would have to obviously be ready before I left New York. \n\nGot called again, maybe a week later. Was told it was fine this time. At first the night guard didn't stay in at night at all, and it is a little wobby, doesn't fit exactly. I called (from CA by now) to ask if I could get a refund if there was a problem, and explained the problem. I was told that wouldn't be possible, and that there was no problem. An explanation/talking about the night guard would have been nice, rather than being told I could deal with it by having it sent to a lab or something here.\n\nIn sum, I'd say go here for a basic cleaning. I can't vouch for the other services.",
            "date": "2012-07-13 06:15:32"
        },
        {
            "review_id": "ulXqsm7MBDwcy7lLYxbCzA",
            "user_id": "0X2uUgavtEhP-1tAmkWegw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 1.0,
            "useful": 1,
            "funny": 0,
            "cool": 0,
            "text": "It may be that Dr. Mapes is the best dentist in the neighborhood but the overall experience after the visit in Williamsburg Smile Design merely deserves one star. The place \"behind the bars\" is very unwelcoming and the front desk staff definitely  needs some good training in customer service. Visit to a dentist may be a very stressful experience, and those people add to the stress. I would not recommend the place because if the staff is allowed to disrespect a customer, it means that an overall morale of the place is not very high.",
            "date": "2012-05-28 15:53:19"
        },
        {
            "review_id": "JNrAoQ7mi1nQpku_VYu0Fw",
            "user_id": "753IjkGXQBEMW1LMjGLIJA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 3,
            "funny": 0,
            "cool": 3,
            "text": "I haven't been to the dentist in a year and a half.  Part of it was lack of dental insurance during a year of road trips followed by art residencies and startup gigs in California; now I'm all set in NYC with a stable job.  So I scheduled this appointment the moment I had a free minute after my new coverage kicked in.  I was expecting a wickedly painful cleaning - and a lot of sighing and head-shaking from a dentist who would be irritated about how much remedial work my neglected teeth needed.  And I was pretty bummed about spending one of my first Saturday mornings in Brooklyn at the dentist's. \n\nWilliamsburg Smile Design turned out to be nothing that I dreaded, not even a waste of a Saturday morning.  The office is sleek and pleasant, with white couches and tasteful mod decor.  The receptionist and hygienist were genuinely friendly and upbeat, so I had a pretty fine relaxing morning despite the click-scrape-whirrrr-whirrrr of metal tools and water and teeny suction hoses in my mouth.  The hygienist was very knowledgeable (totally unlike the usual going-through-the-motions grump), and readily discussed some options for post-ortho work I can have done to make my teeth brushing routine less of a hassle.  The Doc himself was what ya call a swell guy. I do need to have a few minor issues addressed at a later appointment, and he let me know about it without any condescension.  \n\nI'll be returning to Smile Design next month, and I'm almost ... looking forward to a dental appointment?  Weird, but I'll take it.",
            "date": "2012-02-04 18:16:54"
        },
        {
            "review_id": "eu6IogZzonwFjBSbsq9spA",
            "user_id": "bkGzIKRN5lpK-uJ3UVbvOQ",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 3,
            "funny": 0,
            "cool": 0,
            "text": "I've never had a cavity in my adult life so I can't say I hate the dentist. However, I have never looked forward to my bi-annual cleaning and check up.\n\nWhile in between insurance companies, Living Social hit me with a coupon for Williamsburg Smile Design so I checked them out.\n\nGreat waiting area, convenient location off the L train, and the Doc and staff's customer service was top notch. The whole time I felt very well taken care of and welcomed.\n\nLooking forward to my next check up.",
            "date": "2011-12-09 15:39:29"
        },
        {
            "review_id": "Vp9z4Ag9LgzhaoOHVpc6jg",
            "user_id": "AUv0XJFRkpnfShWmmxf6uw",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 4,
            "funny": 0,
            "cool": 1,
            "text": "I can't believe Dr. Mapes doesn't have more reviews on here. In fact I feel guilty for having taken so long to write a review. But I have to give this place some big love.\n\nI too came here via a Living Social and didn't know what to expect. See, I had also just spent a weekend in an incredible amount of pain due to an infection under a tooth that should have been taken out a long time ago. I'm one of those people that doesn't go to the dentist until the very last minute, when drastic measures are usually needed. It's a fault of mine.\n\nSo I went in pain with this coupon, expecting some tsk-tsking as I'd always gotten from dentists in the past. Instead I got caring, nonjudgmental, sincere advice and treatment. Dr. Mapes actually scheduled me info for a root canal ASAP (which was *incredibly* painless and easy) and here I am a few weeks later still amazed at the quality and care I received.\n\nOne last thing: the five stars above aren't just for Dr. Mapes; Jasmine (his Dental Assistant) and Hadeel (Office Manager) deserve them just as much. From walking in the door and being greeted by Hadeel to meeting Jasmine as I began my procedures it was a great experience overall. The office is clean, fancy and modern for sure; but for me it's all about the people and this place is tip top. Highly recommended.",
            "date": "2011-09-29 13:00:59"
        },
        {
            "review_id": "95Ki1L-S416DEKU36jvyuQ",
            "user_id": "302UzbGqxkoPeIxY4XeR5w",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "I have been going to the same dentist for years.  The only reason why I visited a new one was that I live in Brooklyn and my dentist is in LA.  I found the dentist through a coupon from The City Select.  I easily booked a visit through ZocDoc.  It was a very reasonable price and I was excited that it was such a fancy place.  My cleaning was thorough.  All staff was professional.  Everything was spotless.  The dentist took time to explain different ways to close my gaps.  There was no hard sell.  With the exception of my visits to my LA dentist, this is the best dental experience I've ever had.  I highly recommend it.",
            "date": "2011-09-27 23:54:50"
        },
        {
            "review_id": "0tf55PRPUN4vQkuP8Bu0FA",
            "user_id": "dbIeoAWy-EfeQekRL9rYrg",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 4.0,
            "useful": 2,
            "funny": 1,
            "cool": 0,
            "text": "Yay I had a really nice experience here and am happy to write a review. \n\nI came here with a Living Social voucher for a very reasonable cleaning and check-up.  Having no dental insurance this was very kind to my wallet.  And, to have a nice dentist in my neighborhood was great, and saved me from having to trek to yucky Times Square where my old dentist was.  \n\nFirst of all, love any doctor that uses ZocDoc... scheduling appointments online is the BEST and really makes the process easy.  I've had nothing but good experiences with doctors (and now dentists) that I've booked on ZocDoc.  Next, the office is AMAZING.  It's super modern and clean, feels almost like a spa.  I got there 15 minutes early and filled out some paper work, helped myself to a snack (they have some granola bars and tea out for consumption) and was promptly   at 5:45 in the dentist chair, right on schedule (also, a dentist that is open after work is also a huge bonus for me).  Each of the examination rooms has a Netflix Instant flat screen TV so you can watch something while you are waiting or, I'd imagine, while you are getting some work done on your teeth.  I didn't have time for this however as the appointment went very quickly.  There is also a computer screen on the ceiling so you can look at your x-rays... or maybe the Netflix?  I'm not sure but my x-rays were up there when I was in the chair.\n\nMy teeth look and feel great and I was out the door in 20 minutes.  The only reason I'm deducting a star is that it all felt a little TOO quick.  Maybe my old dentist was slow or something but I left feeling a little worried that maybe he had missed something.  But I'm not a dentist so I can't make that judgement call really.  All in all, a great experience and I shall be back.  Oh, and a tip, they use that vibrating cleaner thingie that sprays water (have no idea what this is called but my last dentist uses it too) and your face will get wet, so ladies if you are planning on going out after your appointment bring some make up for a re-touch!",
            "date": "2011-07-06 04:33:05"
        },
        {
            "review_id": "NsiUkUsqEqxZ8B6PbXAMPQ",
            "user_id": "pNCn_shmgNrmOv0XdngKeA",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "Went all the way over from Manhattan to get my teeth cleaned, glad I did. The office is gorgeous, the people are super friendly, you can watch Netflix while having your teeth cleaned (never seen that before), and the cleaning is very quick and gentle. They're also handing out free teeth whitening kits to every new patient. The office is hard to see at first, it's behind a gated parking lot. This is definitely my new permanent dentist.",
            "date": "2011-05-19 01:13:38"
        },
        {
            "review_id": "BNfCXt_GvNROh0A4VA3mWw",
            "user_id": "RZigkE-C0_nCQBaqG3qk9Q",
            "business_id": "-5Kbw0m7lpLDAQSX5t-fVA",
            "stars": 5.0,
            "useful": 0,
            "funny": 0,
            "cool": 0,
            "text": "I have been searching for a dentist since I moved to New York years ago and after reading several reviews, I booked an appointment at Williamsburg Smile Design. The office was easy to get to (just a few blocks from the bedford stop on the L train) and his staff was so helpful. Dr. Mapes did my entire cleaning himself and explained everything as he went which was amazing since I'm a nervous patient. He was professional, quick, and friendly which made it an easy decision to book a follow up appointment. Dr. Mapes is amazing, I have definitely found my NY dentist!",
            "date": "2011-05-17 18:41:38"
        }
    ]
}